MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F4A0SGHB/mcu.h
/*  Bit definition for MPU_SCR register  */
#define MPU_SCR_SMPUBRP_POS                            (0U)
#define MPU_SCR_SMPUBRP                                (0x00000001UL)
#define MPU_SCR_SMPUBWP_POS                            (1U)
#define MPU_SCR_SMPUBWP                                (0x00000002UL)
#define MPU_SCR_SMPUACT_POS                            (2U)
#define MPU_SCR_SMPUACT                                (0x0000000CUL)
#define MPU_SCR_SMPUACT_0                              (0x00000004UL)
#define MPU_SCR_SMPUACT_1                              (0x00000008UL)
#define MPU_SCR_SMPUE_POS                              (7U)
#define MPU_SCR_SMPUE                                  (0x00000080UL)

/*  Bit definition for MPU_FRGE register  */
#define MPU_FRGE_FRG0E_POS                             (0U)
#define MPU_FRGE_FRG0E                                 (0x00000001UL)
#define MPU_FRGE_FRG1E_POS                             (1U)
#define MPU_FRGE_FRG1E                                 (0x00000002UL)
#define MPU_FRGE_FRG2E_POS                             (2U)
#define MPU_FRGE_FRG2E                                 (0x00000004UL)
#define MPU_FRGE_FRG3E_POS                             (3U)
#define MPU_FRGE_FRG3E                                 (0x00000008UL)
#define MPU_FRGE_FRG4E_POS                             (4U)
#define MPU_FRGE_FRG4E                                 (0x00000010UL)
#define MPU_FRGE_FRG5E_POS                             (5U)
#define MPU_FRGE_FRG5E                                 (0x00000020UL)
#define MPU_FRGE_FRG6E_POS                             (6U)
#define MPU_FRGE_FRG6E                                 (0x00000040UL)
#define MPU_FRGE_FRG7E_POS                             (7U)
#define MPU_FRGE_FRG7E                                 (0x00000080UL)

/*  Bit definition for MPU_FRGWP register  */
#define MPU_FRGWP_FRG0WP_POS                           (0U)
#define MPU_FRGWP_FRG0WP                               (0x00000001UL)
#define MPU_FRGWP_FRG1WP_POS                           (1U)
#define MPU_FRGWP_FRG1WP                               (0x00000002UL)
#define MPU_FRGWP_FRG2WP_POS                           (2U)
#define MPU_FRGWP_FRG2WP                               (0x00000004UL)
#define MPU_FRGWP_FRG3WP_POS                           (3U)
#define MPU_FRGWP_FRG3WP                               (0x00000008UL)
#define MPU_FRGWP_FRG4WP_POS                           (4U)
#define MPU_FRGWP_FRG4WP                               (0x00000010UL)
#define MPU_FRGWP_FRG5WP_POS                           (5U)
#define MPU_FRGWP_FRG5WP                               (0x00000020UL)
#define MPU_FRGWP_FRG6WP_POS                           (6U)
#define MPU_FRGWP_FRG6WP                               (0x00000040UL)
#define MPU_FRGWP_FRG7WP_POS                           (7U)
#define MPU_FRGWP_FRG7WP                               (0x00000080UL)

/*  Bit definition for MPU_FRGRP register  */
#define MPU_FRGRP_FRG0RP_POS                           (0U)
#define MPU_FRGRP_FRG0RP                               (0x00000001UL)
#define MPU_FRGRP_FRG1RP_POS                           (1U)
#define MPU_FRGRP_FRG1RP                               (0x00000002UL)
#define MPU_FRGRP_FRG2RP_POS                           (2U)
#define MPU_FRGRP_FRG2RP                               (0x00000004UL)
#define MPU_FRGRP_FRG3RP_POS                           (3U)
#define MPU_FRGRP_FRG3RP                               (0x00000008UL)
#define MPU_FRGRP_FRG4RP_POS                           (4U)
#define MPU_FRGRP_FRG4RP                               (0x00000010UL)
#define MPU_FRGRP_FRG5RP_POS                           (5U)
#define MPU_FRGRP_FRG5RP                               (0x00000020UL)
#define MPU_FRGRP_FRG6RP_POS                           (6U)
#define MPU_FRGRP_FRG6RP                               (0x00000040UL)
#define MPU_FRGRP_FRG7RP_POS                           (7U)
#define MPU_FRGRP_FRG7RP                               (0x00000080UL)

/*  Bit definition for MPU_FCR register  */
#define MPU_FCR_FMPUBRP_POS                            (0U)
#define MPU_FCR_FMPUBRP                                (0x00000001UL)
#define MPU_FCR_FMPUBWP_POS                            (1U)
#define MPU_FCR_FMPUBWP                                (0x00000002UL)
#define MPU_FCR_FMPUACT_POS                            (2U)
#define MPU_FCR_FMPUACT                                (0x0000000CUL)
#define MPU_FCR_FMPUACT_0                              (0x00000004UL)
#define MPU_FCR_FMPUACT_1                              (0x00000008UL)
#define MPU_FCR_FMPUE_POS                              (7U)
#define MPU_FCR_FMPUE                                  (0x00000080UL)

/*  Bit definition for MPU_HRGE register  */
#define MPU_HRGE_HRG0E_POS                             (0U)
#define MPU_HRGE_HRG0E                                 (0x00000001UL)
#define MPU_HRGE_HRG1E_POS                             (1U)
#define MPU_HRGE_HRG1E                                 (0x00000002UL)
#define MPU_HRGE_HRG2E_POS                             (2U)
#define MPU_HRGE_HRG2E                                 (0x00000004UL)
#define MPU_HRGE_HRG3E_POS                             (3U)
#define MPU_HRGE_HRG3E                                 (0x00000008UL)
#define MPU_HRGE_HRG4E_POS                             (4U)
#define MPU_HRGE_HRG4E                                 (0x00000010UL)
#define MPU_HRGE_HRG5E_POS                             (5U)
#define MPU_HRGE_HRG5E                                 (0x00000020UL)
#define MPU_HRGE_HRG6E_POS                             (6U)
#define MPU_HRGE_HRG6E                                 (0x00000040UL)
#define MPU_HRGE_HRG7E_POS                             (7U)
#define MPU_HRGE_HRG7E                                 (0x00000080UL)

/*  Bit definition for MPU_HRGWP register  */
#define MPU_HRGWP_HRG0WP_POS                           (0U)
#define MPU_HRGWP_HRG0WP                               (0x00000001UL)
#define MPU_HRGWP_HRG1WP_POS                           (1U)
#define MPU_HRGWP_HRG1WP                               (0x00000002UL)
#define MPU_HRGWP_HRG2WP_POS                           (2U)
#define MPU_HRGWP_HRG2WP                               (0x00000004UL)
#define MPU_HRGWP_HRG3WP_POS                           (3U)
#define MPU_HRGWP_HRG3WP                               (0x00000008UL)
#define MPU_HRGWP_HRG4WP_POS                           (4U)
#define MPU_HRGWP_HRG4WP                               (0x00000010UL)
#define MPU_HRGWP_HRG5WP_POS                           (5U)
#define MPU_HRGWP_HRG5WP                               (0x00000020UL)
#define MPU_HRGWP_HRG6WP_POS                           (6U)
#define MPU_HRGWP_HRG6WP                               (0x00000040UL)
#define MPU_HRGWP_HRG7WP_POS                           (7U)
#define MPU_HRGWP_HRG7WP                               (0x00000080UL)

/*  Bit definition for MPU_HRGRP register  */
#define MPU_HRGRP_HRG0RP_POS                           (0U)
#define MPU_HRGRP_HRG0RP                               (0x00000001UL)
#define MPU_HRGRP_HRG1RP_POS                           (1U)
#define MPU_HRGRP_HRG1RP                               (0x00000002UL)
#define MPU_HRGRP_HRG2RP_POS                           (2U)
#define MPU_HRGRP_HRG2RP                               (0x00000004UL)
#define MPU_HRGRP_HRG3RP_POS                           (3U)
#define MPU_HRGRP_HRG3RP                               (0x00000008UL)
#define MPU_HRGRP_HRG4RP_POS                           (4U)
#define MPU_HRGRP_HRG4RP                               (0x00000010UL)
#define MPU_HRGRP_HRG5RP_POS                           (5U)
#define MPU_HRGRP_HRG5RP                               (0x00000020UL)
#define MPU_HRGRP_HRG6RP_POS                           (6U)
#define MPU_HRGRP_HRG6RP                               (0x00000040UL)
#define MPU_HRGRP_HRG7RP_POS                           (7U)
#define MPU_HRGRP_HRG7RP                               (0x00000080UL)

/*  Bit definition for MPU_HCR register  */
#define MPU_HCR_HMPUBRP_POS                            (0U)
#define MPU_HCR_HMPUBRP                                (0x00000001UL)
#define MPU_HCR_HMPUBWP_POS                            (1U)
#define MPU_HCR_HMPUBWP                                (0x00000002UL)
#define MPU_HCR_HMPUACT_POS                            (2U)
#define MPU_HCR_HMPUACT                                (0x0000000CUL)
#define MPU_HCR_HMPUACT_0                              (0x00000004UL)
#define MPU_HCR_HMPUACT_1                              (0x00000008UL)
#define MPU_HCR_HMPUE_POS                              (7U)
#define MPU_HCR_HMPUE                                  (0x00000080UL)

/*  Bit definition for MPU_ERGE register  */
#define MPU_ERGE_ERG0E_POS                             (0U)
#define MPU_ERGE_ERG0E                                 (0x00000001UL)
#define MPU_ERGE_ERG1E_POS                             (1U)
#define MPU_ERGE_ERG1E                                 (0x00000002UL)
#define MPU_ERGE_ERG2E_POS                             (2U)
#define MPU_ERGE_ERG2E                                 (0x00000004UL)
#define MPU_ERGE_ERG3E_POS                             (3U)
#define MPU_ERGE_ERG3E                                 (0x00000008UL)
#define MPU_ERGE_ERG4E_POS                             (4U)
#define MPU_ERGE_ERG4E                                 (0x00000010UL)
#define MPU_ERGE_ERG5E_POS                             (5U)
#define MPU_ERGE_ERG5E                                 (0x00000020UL)
#define MPU_ERGE_ERG6E_POS                             (6U)
#define MPU_ERGE_ERG6E                                 (0x00000040UL)
#define MPU_ERGE_ERG7E_POS                             (7U)
#define MPU_ERGE_ERG7E                                 (0x00000080UL)

/*  Bit definition for MPU_ERGWP register  */
#define MPU_ERGWP_ERG0WP_POS                           (0U)
#define MPU_ERGWP_ERG0WP                               (0x00000001UL)
#define MPU_ERGWP_ERG1WP_POS                           (1U)
#define MPU_ERGWP_ERG1WP                               (0x00000002UL)
#define MPU_ERGWP_ERG2WP_POS                           (2U)
#define MPU_ERGWP_ERG2WP                               (0x00000004UL)
#define MPU_ERGWP_ERG3WP_POS                           (3U)
#define MPU_ERGWP_ERG3WP                               (0x00000008UL)
#define MPU_ERGWP_ERG4WP_POS                           (4U)
#define MPU_ERGWP_ERG4WP                               (0x00000010UL)
#define MPU_ERGWP_ERG5WP_POS                           (5U)
#define MPU_ERGWP_ERG5WP                               (0x00000020UL)
#define MPU_ERGWP_ERG6WP_POS                           (6U)
#define MPU_ERGWP_ERG6WP                               (0x00000040UL)
#define MPU_ERGWP_ERG7WP_POS                           (7U)
#define MPU_ERGWP_ERG7WP                               (0x00000080UL)

/*  Bit definition for MPU_ERGRP register  */
#define MPU_ERGRP_ERG0RP_POS                           (0U)
#define MPU_ERGRP_ERG0RP                               (0x00000001UL)
#define MPU_ERGRP_ERG1RP_POS                           (1U)
#define MPU_ERGRP_ERG1RP                               (0x00000002UL)
#define MPU_ERGRP_ERG2RP_POS                           (2U)
#define MPU_ERGRP_ERG2RP                               (0x00000004UL)
#define MPU_ERGRP_ERG3RP_POS                           (3U)
#define MPU_ERGRP_ERG3RP                               (0x00000008UL)
#define MPU_ERGRP_ERG4RP_POS                           (4U)
#define MPU_ERGRP_ERG4RP                               (0x00000010UL)
#define MPU_ERGRP_ERG5RP_POS                           (5U)
#define MPU_ERGRP_ERG5RP                               (0x00000020UL)
#define MPU_ERGRP_ERG6RP_POS                           (6U)
#define MPU_ERGRP_ERG6RP                               (0x00000040UL)
#define MPU_ERGRP_ERG7RP_POS                           (7U)
#define MPU_ERGRP_ERG7RP                               (0x00000080UL)

/*  Bit definition for MPU_ECR register  */
#define MPU_ECR_EMPUBRP_POS                            (0U)
#define MPU_ECR_EMPUBRP                                (0x00000001UL)
#define MPU_ECR_EMPUBWP_POS                            (1U)
#define MPU_ECR_EMPUBWP                                (0x00000002UL)
#define MPU_ECR_EMPUACT_POS                            (2U)
#define MPU_ECR_EMPUACT                                (0x0000000CUL)
#define MPU_ECR_EMPUACT_0                              (0x00000004UL)
#define MPU_ECR_EMPUACT_1                              (0x00000008UL)
#define MPU_ECR_EMPUE_POS                              (7U)
#define MPU_ECR_EMPUE                                  (0x00000080UL)

